Бухгалтерские_задачи_по_методичке/src/Documents/РегламентПереоценкаВалютныхСчетов/РегламентПереоценкаВалютныхСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегламентПереоценкаВалютныхСчетов</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

Бухгалтерские_задачи_по_методичке/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Бухгалтерский</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаХолдинга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Бухгалтерские_задачи_по_методичке/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Бухгалтерские_задачи_по_методичке/src/ChartsOfAccounts/Бухгалтерский/Бухгалтерский.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Бухгалтерский</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>1</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>1.1</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>1.2</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>1.3</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>2</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>2.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>2.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>3</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>ТоварыНаХранении</name>
      <description>Товары на хранении</description>
      <code>6</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>УчетПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Бухгалтерские_задачи_по_методичке/src/Documents/РегламентПереоценкаВалютныхСчетов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Бухгалтерский.Ссылка
	|ИЗ
	|	ПланСчетов.Бухгалтерский КАК Бухгалтерский
	|ГДЕ
	|	Бухгалтерский.Валютный = ИСТИНА";

	РезультатЗапроса = Запрос.Выполнить();

	Блокировка = Новый БлокировкаДанных;

	ЧтоБлокируем = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
	ЧтоБлокируем.ИсточникДанных = РезультатЗапроса;

	ЧтоБлокируем.ИспользоватьИзИсточникаДанных("Счет", "Ссылка");

	Блокировка.Заблокировать();
	
	
	

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПроводкиОстатки.Счет,
	|	ПроводкиОстатки.Субконто1,
	|	ПроводкиОстатки.Субконто2,
	|	ПроводкиОстатки.Подразделение,
	|	ПроводкиОстатки.Валюта,
	|	ПроводкиОстатки.СуммаОстатокДт,
	|	ПроводкиОстатки.СуммаОстатокКт,
	|	ПроводкиОстатки.ВалютнаяСуммаОстатокДт,
	|	ПроводкиОстатки.ВалютнаяСуммаОстатокКт
	|ПОМЕСТИТЬ ВТОстатки
	|ИЗ
	|	РегистрБухгалтерии.Проводки.Остатки(&Период, Счет.Валютный = ИСТИНА,, Организация = &Организация) КАК ПроводкиОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТОстатки.Счет КАК Счет,
	|	ВТОстатки.Субконто1,
	|	ВТОстатки.Субконто2,
	|	ВТОстатки.Подразделение КАК Подразделение,
	|	ВТОстатки.Валюта КАК Валюта,
	|	ВТОстатки.СуммаОстатокДт,
	|	ВТОстатки.СуммаОстатокКт,
	|	ВТОстатки.ВалютнаяСуммаОстатокДт,
	|	ВТОстатки.ВалютнаяСуммаОстатокКт,
	|	ЕСТЬNULL(КурсыВалютСрезПоследних.Курс, 0) КАК Курс,
	|	ЕСТЬNULL(КурсыВалютСрезПоследних.Кратность, 0) КАК Кратность
	|ИЗ
	|	ВТОстатки КАК ВТОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период,) КАК КурсыВалютСрезПоследних
	|		ПО ВТОстатки.Валюта = КурсыВалютСрезПоследних.Валюта
	|ИТОГИ
	|	МАКСИМУМ(Курс) КАК Курс,
	|	МАКСИМУМ(Кратность) КАК Кратность
	|ПО
	|	Валюта,
	|	Счет";

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Период", Дата);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаВалюта = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаВалюта.Следующий() Цикл

		Если (ВыборкаВалюта.Кратность = 0) Тогда
			КроссКурс = ВыборкаВалюта.Курс * 10000;
		Иначе
			КроссКурс = ВыборкаВалюта.Курс / ВыборкаВалюта.Кратность * 10000;
		КонецЕсли;

		ВыборкаСчет = ВыборкаВалюта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

		Пока ВыборкаСчет.Следующий() Цикл

			ВыборкаДетальныеЗаписи = ВыборкаСчет.Выбрать();

			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

				КурсоваяРазница = ВыборкаДетальныеЗаписи.ВалютнаяСуммаОстатокДт * КроссКурс / 10000
					- ВыборкаДетальныеЗаписи.СуммаОстатокДт;
				
				//Если КурсоваяРазница = 0 то в если не зайдем.
				Если (КурсоваяРазница > 0) Тогда
					ДоходыОтКурсовойРазницы(КурсоваяРазница, ВыборкаДетальныеЗаписи.Счет,
						ВыборкаДетальныеЗаписи.Подразделение, ВыборкаДетальныеЗаписи.Валюта,
						ВыборкаДетальныеЗаписи.Субконто1, ВыборкаДетальныеЗаписи.Субконто2);
				ИначеЕсли (КурсоваяРазница < 0) Тогда

					РасходыОтКурсовойРазницы(-1 * КурсоваяРазница, ВыборкаДетальныеЗаписи.Счет,
						ВыборкаДетальныеЗаписи.Подразделение, ВыборкаДетальныеЗаписи.Валюта,
						ВыборкаДетальныеЗаписи.Субконто1, ВыборкаДетальныеЗаписи.Субконто2);

				КонецЕсли;

				КурсоваяРазница = ВыборкаДетальныеЗаписи.ВалютнаяСуммаОстатокКт * КроссКурс / 10000
					- ВыборкаДетальныеЗаписи.СуммаОстатокКт;
				
				//Если КурсоваяРазница = 0 то в если не зайдем.
				Если (КурсоваяРазница < 0) Тогда
					ДоходыОтКурсовойРазницы(-1 * КурсоваяРазница, ВыборкаДетальныеЗаписи.Счет,
						ВыборкаДетальныеЗаписи.Подразделение, ВыборкаДетальныеЗаписи.Валюта,
						ВыборкаДетальныеЗаписи.Субконто1, ВыборкаДетальныеЗаписи.Субконто2);
				ИначеЕсли (КурсоваяРазница > 0) Тогда

					РасходыОтКурсовойРазницы(КурсоваяРазница, ВыборкаДетальныеЗаписи.Счет,
						ВыборкаДетальныеЗаписи.Подразделение, ВыборкаДетальныеЗаписи.Валюта,
						ВыборкаДетальныеЗаписи.Субконто1, ВыборкаДетальныеЗаписи.Субконто2);

				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

	Движения.Проводки.Записывать = Истина;

КонецПроцедуры

Процедура ДоходыОтКурсовойРазницы(КурсоваяРазница, Счет, Подразделение, Валюта, Субконто1, Субконто2)

	Движение = Движения.Проводки.Добавить();

	Движение.СчетДт = Счет;
	Движение.ВалютаДт = Валюта;
	БухгалтерияСервер.УстановитьСубконто(Счет, Движение.СубконтоДт, 1, Субконто1);
	БухгалтерияСервер.УстановитьСубконто(Счет, Движение.СубконтоДт, 2, Субконто2);
	Движение.ВалютнаяСуммаДт = 0;

	Движение.СчетКт = ПланыСчетов.Бухгалтерский.Капитал;

	БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);

	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Сумма = КурсоваяРазница;
	Движение.Содержание = "Доходы от курсовой разницы";

КонецПроцедуры

Процедура РасходыОтКурсовойРазницы(КурсоваяРазница, Счет, Подразделение, Валюта, Субконто1, Субконто2)

	Движение = Движения.Проводки.Добавить();

	Движение.СчетДт = ПланыСчетов.Бухгалтерский.Капитал;

	Движение.СчетКт = Счет;
	Движение.ВалютаКт = Валюта;
	Движение.ВалютнаяСуммаКт = 0;
	БухгалтерияСервер.УстановитьСубконто(Счет, Движение.СубконтоКт, 1, Субконто1);
	БухгалтерияСервер.УстановитьСубконто(Счет, Движение.СубконтоКт, 2, Субконто2);

	БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Подразделение, Подразделение);

	Движение.Период = Дата;
	Движение.Организация = Организация;
	Движение.Сумма = КурсоваяРазница;
	Движение.Содержание = "Расходы от курсовой разницы";

КонецПроцедуры
